{"370 Client Electricity Loads  2011 - 2014":{"description":"Data set has no missing values.\nValues are in kW of each 15 min. To convert values in kWh values must be divided by 4.\nEach column represent one client. Some clients were created after 2011. In these cases consumption were considered zero.\nAll time labels report to Portuguese hour. However all days present 96 measures (24*15). Every year in March time change day (which has only 23 hours) the values between 1:00 am and 2:00 am are zero for all points. Every year in October time change day (which has 25 hours) the values between 1:00 am and 2:00 am aggregate the consumption of two hours.","link":"https://archive.ics.uci.edu/ml/datasets/ElectricityLoadDiagrams20112014","type":"dataset","id":"370 Client Electricity Loads  2011 - 2014","title":"370 Client Electricity Loads  2011 - 2014"},"Appliances energy prediction Data Set":{"description":"The data set is at 10 min for about 4.5 months. The house temperature and humidity conditions were monitored with a ZigBee wireless sensor network. Each wireless node transmitted the temperature and humidity conditions around 3.3 min. Then, the wireless data was averaged for 10 minutes periods. The energy data was logged every 10 minutes with m-bus energy meters. Weather from the nearest airport weather station (Chievres Airport, Belgium) was downloaded from a public data set from Reliable Prognosis (rp5.ru), and merged together with the experimental data sets using the date and time column. Two random variables have been included in the data set for testing the regression models and to filter out non predictive attributes (parameters).","link":"https://archive.ics.uci.edu/ml/datasets/Appliances+energy+prediction","type":"dataset","id":"Appliances energy prediction Data Set","title":"Appliances energy prediction Data Set"},"BANES Energy Data Electricity":{"description":"Electricity energy usage data in Council buildings, UK.","link":"https://data.bathhacked.org/Government-and-Society/BANES-Energy-Data-Electricity/fqa5-b8ri","type":"dataset","id":"BANES Energy Data Electricity","title":"BANES Energy Data Electricity"},"CER Smart Meter Project by Irish Social Science Data Archive.":{"description":"CER Smart Meter Project by Irish Social Science Data Archive. Mean energy consumption of 5000 homes and business in Ireland.","link":"https://github.com/wwzjustin/CER-Smart-Meter-Project-by-Irish-Social-Science-Data-Archive./blob/master/result/daily%20mean.xlsx","type":"dataset","id":"CER Smart Meter Project by Irish Social Science Data Archive.","title":"CER Smart Meter Project by Irish Social Science Data Archive."},"Commercial Buildings Energy Consumption Survey (CBECS)":{"description":"The Commercial Buildings Energy Consumption Survey (CBECS) is a national sample survey that collects information on the stock of U.S. commercial buildings, including their energy-related building characteristics and energy usage data (consumption and expenditures). Commercial buildings include all buildings in which at least half of the floorspace is used for a purpose that is not residential, industrial, or agricultural. By this definition, CBECS includes building types that might not traditionally be considered commercial, such as schools, hospitals, correctional institutions, and buildings used for religious worship, in addition to traditional commercial buildings such as stores, restaurants, warehouses, and office buildings.","link":"https://www.eia.gov/consumption/commercial/data/2012/","type":"dataset","id":"Commercial Buildings Energy Consumption Survey (CBECS)","title":"Commercial Buildings Energy Consumption Survey (CBECS)"},"Dataset (TC1a)":"Basic Profiling of Domestic Smart Meter Customers UK:\ndescription: \"This dataset forms part of a comprehensive suite of results, derived from the CLNR project’s trials with more than 12,000 UK electricity customers. The August 2014 datasets cover both load and generation profiles, as well as the potential for customer flexibility. The dataset is presented in an open and usable format.\"\nlink: http://www.networkrevolution.co.uk/project-library/dataset-tc1a-basic-profiling-domestic-smart-meter-customers/\ntype: dataset","Georgia Tech Campus EV Charging Station Dataset":{"description":"Georgia Tech Electric Vehicles Charging Station Datasets","link":"https://github.com/Sheldon-Zhang/Gatech_EV_Analytics","type":"dataset","author":"Xiaochen Zhang","contributorGithubHandle":"Sheldon-Zhang","contributorLinkedinHandle":"zhangxiaochen","id":"Georgia Tech Campus EV Charging Station Dataset","title":"Georgia Tech Campus EV Charging Station Dataset"},"Georgia Tech Campus EV Charging Behavior Study":{"description":"Study on Georgia Tech Electric Vehicle Charging Stations.\nMatlab code and visualization included.","link":"https://github.com/Sheldon-Zhang/Gatech_EV_Analytics","type":"code","externalDatasetsUsed":["Georgia Tech Campus EV Charging Station Dataset"],"author":"Xiaochen Zhang","contributorGithubHandle":"Sheldon-Zhang","contributorLinkedinHandle":"zhangxiaochen","id":"Georgia Tech Campus EV Charging Behavior Study","title":"Georgia Tech Campus EV Charging Behavior Study"},"Commercial and Residential Hourly Load Profiles for all TMY3 Locations in the United States":{"description":"This dataset contains hourly load profile data for 16 commercial building types (based off the DOE commercial reference building models) and residential buildings (based off the Building America House Simulation Protocols). This dataset also uses the Residential Energy Consumption Survey (RECS) for statistical references of building types by location. Hourly load profiles are available for over all TMY3 locations in the United States here. Browse files in this dataset, accessible as individual files and as commercial and residential downloadable ZIP files. This dataset is approximately 4.8GiB compressed or 19GiB uncompressed.","link":"https://openei.org/datasets/dataset/commercial-and-residential-hourly-load-profiles-for-all-tmy3-locations-in-the-united-states","type":"dataset","id":"Commercial and Residential Hourly Load Profiles for all TMY3 Locations in the United States","title":"Commercial and Residential Hourly Load Profiles for all TMY3 Locations in the United States"},"RAE":"The Rainforest Automation Energy Dataset:\ndescription: \"The Rainforest Automation Energy (RAE) dataset to help smart grid researchers test their algorithms which make use of smart meter data. This initial release of RAE contains 1Hz data (mains and sub-meters) from two a residential house. In addition to power data, environmental and sensor data from the house's thermostat is included. Sub-meter data from one of the houses includes heat pump and rental suite captures which is of interest to power utilities. (2017-05-01)\"\nlink: https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/ZJW4LC\ntype: dataset","Residential Energy Consumption Survey (RECS)":{"description":"EIA administers the Residential Energy Consumption Survey (RECS) to a nationally representative sample of housing units. Traditionally, specially trained interviewers collect energy characteristics on the housing unit, usage patterns, and household demographics. For the 2015 survey cycle, EIA used Web and mail forms, in addition to in-person interviews, to collect detailed information on household energy characteristics. This information is combined with data from energy suppliers to these homes to estimate energy costs and usage for heating, cooling, appliances and other end uses — information critical to meeting future energy demand and improving efficiency and building design.\nFirst conducted in 1978, the fourteenth RECS collected data from more than 5,600 households in housing units statistically selected to represent the 118.2 million housing units that are occupied as a primary residence. Data from the 2015 RECS are tabulated by geography and for particularly characteristics, such as housing unit type and income, that are of particular interest to energy analysis.","link":"https://www.eia.gov/consumption/residential/data/2015/","type":"dataset","id":"Residential Energy Consumption Survey (RECS)","title":"Residential Energy Consumption Survey (RECS)"},"SmartMeter Energy Consumption Data in London Households - UK Power Networks":{"description":"Energy consumption readings for a sample of 5,567 London Households that took part in the UK Power Networks led Low Carbon London project between November 2011 and February 2014. Readings were taken at half hourly intervals. Households have been allocated to a CACI Acorn group (2010).  The customers in the trial were recruited as a balanced sample representative of the Greater London population.The dataset contains energy consumption, in kWh (per half hour), unique household identifier, date and time, and CACI Acorn group. The CSV file is around 10GB when unzipped and contains around 167million rows. Within the data set are two groups of customers. The first is a sub-group, of approximately 1100 customers, who were subjected to Dynamic Time of Use (dToU) energy prices throughout the 2013 calendar year period.  The tariff prices were given a day ahead via the Smart Meter IHD (In Home Display) or text message to mobile phone. Customers were issued High (67.20p/kWh), Low (3.99p/kWh) or normal (11.76p/kWh) price signals and the times of day these applied. The dates/times and the price signal schedule is availaible as part of this dataset. All non-Time of Use customers were on a flat rate tariff of 14.228pence/kWh.","link":"https://data.london.gov.uk/dataset/smartmeter-energy-use-data-in-london-households","type":"dataset","id":"SmartMeter Energy Consumption Data in London Households - UK Power Networks","title":"SmartMeter Energy Consumption Data in London Households - UK Power Networks"},"Visualizations of REFIT Electrical Load Measurements Dataset":{"description":"Python + Jupyter Notebook code exploring the REFIT Electrical Load Measurements Dataset","link":"https://github.com/RSLi/REFIT-Visualizations/blob/master/REFIT.ipynb","type":"code","datasetsUsed":["REFIT Electrical Load Measurements dataset"],"author":"Siwei Li","contributorGithubHandle":"RSLi","contributorLinkedinHandle":"robertsiweili","id":"Visualizations of REFIT Electrical Load Measurements Dataset","title":"Visualizations of REFIT Electrical Load Measurements Dataset"},"Individual household electric power consumption, France":{"description":"This archive contains 2075259 measurements gathered in a house located in Sceaux (7km of Paris, France) between December 2006 and November 2010 (47 months).\nNotes:\n1.(global_active_power*1000/60 - sub_metering_1 - sub_metering_2 - sub_metering_3) represents the active energy consumed every minute (in watt hour) in the household by electrical equipment not measured in sub-meterings 1, 2 and 3.\n2.The dataset contains some missing values in the measurements (nearly 1,25% of the rows). All calendar timestamps are present in the dataset but for some timestamps, the measurement values are missing: a missing value is represented by the absence of value between two consecutive semi-colon attribute separators. For instance, the dataset shows missing values on April 28, 2007.","link":"https://archive.ics.uci.edu/ml/datasets/Individual+household+electric+power+consumption","type":"dataset","id":"Individual household electric power consumption, France","title":"Individual household electric power consumption, France"},"Almanac of Minutely Power Dataset (AMPds)":{"type":"dataset","link":"http://ampds.org","description":"The AMPds dataset has been release to help load disaggregation/NILM and eco-feedback researchers test their algorithms, models, systems, and prototypes. AMPds contains electricity, water, and natural gas measurements at one minute intervals — a total of 1,051,200 readings per meter for 2 years of monitoring. Weather data from Environment Canada\\'s YVR weather station has also been added. This hourly weather data covers the same period of time as AMPds and includes a summary of climate normals observed from the years between 1981-2010. Utility billing data is also included for cost analyses.","id":"Almanac of Minutely Power Dataset (AMPds)","title":"Almanac of Minutely Power Dataset (AMPds)"},"Controlled On/Off Loads Library dataset (COOLL)":{"type":"dataset","link":"https://coolldataset.github.io","description":"The Controlled On/Off Loads Library (COOLL) is a dataset of high-sampled electrical current and voltage measurements representing individual appliances consumption. The measurements were taken in June 2016 in the PRISME laboratory of the University of Orléans, France. The appliances are mainly controllable appliances (i.e. we can precisely control their turn-on/off time instants). 42 appliances of 12 types were measured at a 100 kHz sampling frequency","id":"Controlled On/Off Loads Library dataset (COOLL)","title":"Controlled On/Off Loads Library dataset (COOLL)"},"Electricity Consumption & Occupancy data set (ECO)":{"type":"dataset","link":"https://www.vs.inf.ethz.ch/res/show.html?what=eco-data","description":"This website provides access to the ECO data set (Electricity Consumption and Occupancy). The ECO data set is a comprehensive data set for non-intrusive load monitoring and occupancy detection research. It was collected in 6 Swiss households over a period of 8 months. For each of the households, the ECO data set provides: 1 Hz aggregate consumption data. Each measurement contains data on current, voltage, and phase shift for each of the three phases in the household; 1 Hz plug-level data measured from selected appliances. Occupancy information measured through a tablet computer (manual labeling) and a passive infrared sensor (in some of the households). We make the ECO data set available to the research community. You may directly access the data set, but we always like to receive a short description on what you plan to do with the data via e-mail to Wilhelm Kleiminger.","id":"Electricity Consumption & Occupancy data set (ECO)","title":"Electricity Consumption & Occupancy data set (ECO)"},"GREEND Dataset":{"type":"dataset","link":"https://sourceforge.net/projects/greend/","description":"GREEND is an energy dataset containing power measurements collected from multiple households in Austria and Italy. It provides detailed energy profiles on a per device basis with a sampling rate of 1 Hz. We expect to regularly provide snapshots of the dataset as more data is recorded and measurement platforms deployed. The GREEND dataset is free to use in research and commercial applications. If you want to access the data, please fill out the brief form at http://goo.gl/rtXjxT which will eventually provide you with the credentials to open the dataset archive.","id":"GREEND Dataset","title":"GREEND Dataset"},"Reference Energy Disaggregation Dataset (REDD)":{"type":"dataset","link":"http://redd.csail.mit.edu","description":"This is the home page for the REDD data set. Below you can download an initial version of the data set, containing several weeks of power data for 6 different homes, and high-frequency current/voltage data for the main power supply of two of these homes.","id":"Reference Energy Disaggregation Dataset (REDD)","title":"Reference Energy Disaggregation Dataset (REDD)"},"Indian Dataset for Ambient Water and Energy (iAWE)":{"type":"dataset","link":"http://iawe.github.io","description":"In the summer of 2013, we decided to instrument a home in New Delhi India with an aim to characterize the unique aspects of energy monitoring consumption in India. In total we collected about 73 days of data.","id":"Indian Dataset for Ambient Water and Energy (iAWE)","title":"Indian Dataset for Ambient Water and Energy (iAWE)"},"Pecan Street Research Institute":{"type":"dataset","link":"https://dataport.cloud","description":"Pecan Street has developed a residential electric use disaggregation algorithm training kit, previously available only to members of its university consortium and clients of its algorithm evaluation service that is now publicly available. This unique kit includes a 15-minute whole home dataset and 1-minute interval circuit-level dataset for packages of 10 to 100 homes in Austin","id":"Pecan Street Research Institute","title":"Pecan Street Research Institute"},"REFIT Electrical Load Measurements dataset":{"type":"dataset","link":"https://pure.strath.ac.uk/portal/en/datasets/refit-electrical-load-measurements(31da3ece-f902-4e95-a093-e0a9536983c4).html","description":"The REFIT Electrical Load Measurements dataset includes raw electrical consumption data in Watts for 20 households at aggregate and appliance level, timestamped and sampled at 8 second intervals. This dataset is intended to be used for research into energy conservation and advanced energy services, ranging from non-intrusive appliance load monitoring, demand response measures, tailored energy and retrofit advice, appliance usage analysis, consumption and time-use statistics and smart home/building automation.","id":"REFIT Electrical Load Measurements dataset","title":"REFIT Electrical Load Measurements dataset"},"Smart* Home Data Set":{"type":"dataset","link":"http://traces.cs.umass.edu/index.php/Smart/Smart","description":"The goal of the Smart* project is to optimize home energy consumption. Available here is a wide variety of data collected from three real homes, including electrical (usage and generation), environmental (e.g., temperature and humidity), and operational (e.g., wall switch events). Also available is minute-level electricity usage data from 400+ anonymous homes. Please see the Smart* home page for general information about the project, or the Smart* Tools download page for software that was used in the collection of this data.","id":"Smart* Home Data Set","title":"Smart* Home Data Set"},"Tracebase":{"type":"dataset","link":"https://www.tracebase.org","description":"The Controlled On/Off Loads Library (COOLL) is a dataset of high-sampled electrical current and voltage measurements representing individual appliances consumption. The measurements were taken in June 2016 in the PRISME laboratory of the University of Orléans, France. The appliances are mainly controllable appliances (i.e. we can precisely control their turn-on/off time instants). 42 appliances of 12 types were measured at a 100 kHz sampling frequency","id":"Tracebase","title":"Tracebase"},"UK Domestic Appliance-Level Electricity (UK-DALE) dataset":{"type":"dataset","link":"http://www.doc.ic.ac.uk/~dk3810/data/","description":"April 2017 release: This dataset records the power demand from five houses. In each house we record both the whole-house mains power demand every six seconds as well as power demand from individual appliances every six seconds. In three of the five houses (houses 1, 2 and 5) we also record the whole-house voltage and current at 16 kHz. Each release of the dataset is labelled with the month and year. The most recent (and probably final) release is for April 2017. UK-DALE now includes 4.3 years of data for house 1.","id":"UK Domestic Appliance-Level Electricity (UK-DALE) dataset","title":"UK Domestic Appliance-Level Electricity (UK-DALE) dataset"}}
